Revit 2027 API
ExportPatternKey(ExportPatternKey) Constructor
 Constructs a new copy of the input ExportPatternKey object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportPatternKey(
	ExportPatternKey other
)
Public Sub New (
	other As ExportPatternKey
)
public:
ExportPatternKey(
	ExportPatternKey^ other
)
new :
        other : ExportPatternKey -> ExportPatternKey
Parameters
other ExportPatternKey
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportPatternKey Class
ExportPatternKey Overload
Autodesk.Revit.DB Namespace